GT1/turbulent_wedge/turbulent_wedge_kE/turbulent_wedge_kE_HRN_WF/turbulent_wedge_kE_HRN_WF_low_l/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

//1 to 10 times laminar vis
internalField   uniform 1e-12;
//internalField   uniform 0;	
//internalField   uniform 5e-05;	

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    top
    {
//Disable completely the wall functions treatment
//need to use fixedValue in the other wall functions variables
        //type            fixedValue;
        //value           uniform 1e-12;

	//Best for LRN (1)
	//(1)
        //type 	   	nutLowReWallFunction;
        //value           uniform 1e-12;

	//LRN-HRN (1)
        type 	   	  nutUSpaldingWallFunction;
        value           uniform 1e-12;

	//Best for HRN (1)
        //type 	   	  nutUWallFunction;
        //value           uniform 1e-12;

	//Best for HRN (1)
        //type 	   	  nutkWallFunction;
        //value           uniform 1e-12;

//(1) OK for LaunderSharmaKE

    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
}

// ************************************************************************* //
